redd82/HaptiCap_V2_ESP32/src/main.cpp
      }
      return GPSTimeMinsSecs;
}

String getGPSTimeMins(){
    if (gps.time.isUpdated()){
        hours = gps.time.hour() + config.timeZoneOffset;
        mins = gps.time.minute();
      if(hours<10){
        GPSTimeMins = "0" + String(hours);  
      }else{
         GPSTimeMins = String(hours);  
        }
      if(mins<10){
        GPSTimeMins = GPSTimeMins + ":" + "0" + String(mins);
      }else{
        GPSTimeMins = GPSTimeMins + ":" + String(mins);
        }
      }
      else{
        GPSTimeMins = "00:00";
      }
      return GPSTimeMins;
}

String getGPSDate(){
  if(!startup){
    while(!gps.date.isUpdated()){
      //Serial.println(".");
    }
  }
      if (gps.date.isUpdated()){
        day = gps.date.day();
        month = gps.date.month();
        year = gps.date.year();
        GPSDate = String(year) + "-" + String(month) + "-" + String(day);
      }
      return GPSDate;
}

unsigned long distance2waypoint(float waypoint_latt, float waypoint_long){ 
    unsigned long distanceToWaypoint = (unsigned long)TinyGPSPlus::distanceBetween(SensorDataDoc["ownLat"].as<float>(),SensorDataDoc["ownLon"].as<float>(),waypoint_latt,waypoint_long);
    return distanceToWaypoint;
}

float coarse2waypoint(float waypoint_latt, float waypoint_long){
    float coarseToWaypoint = TinyGPSPlus::courseTo(SensorDataDoc["ownLat"].as<float>(),SensorDataDoc["ownLon"].as<float>(),waypoint_latt,waypoint_long);
    //const char *cardinalToWaypoint = TinyGPSPlus::cardinal(coarseToWaypoint);
    return coarseToWaypoint;
}

float CalcRelHeading(float compforheading,float coarseforWaypoint){
    float relativeHeading;
    if (coarseforWaypoint > compforheading){   
      relativeHeading = coarseforWaypoint - compforheading;
    }
    else{
      relativeHeading = 360.0 - compforheading + coarseforWaypoint;
    }
    return relativeHeading;
}

void updateSensorData(){
  if (millis() > 5000 && gps.charsProcessed() < 10){
      Serial.println(F("No GPS data received: check wiring"));
  } else {
      delay(10);
      String temp;
      sensorData.gpsTime = gps.time.centisecond();
      sensorData.ownLat = gps.location.lat();
      sensorData.ownLon = gps.location.lng();
      sensorData.coarse2home = coarse2waypoint(sensorData.ownLat, sensorData.ownLon);
      sensorData.distance2home = distance2waypoint(sensorData.homeBaseLat, sensorData.homeBaseLon);
      temp = TinyGPSPlus::cardinal(sensorData.coarse2home);
      temp.toCharArray(sensorData.cardinal2home,8);
      sensorData.coarsewaypoint = coarse2waypoint(config.WAYPOINT_LAT, config.WAYPOINT_LON);
      sensorData.distancewaypoint = distance2waypoint(config.WAYPOINT_LAT, config.WAYPOINT_LON);      
      sensorData.relheading = CalcRelHeading(compassheading, sensorData.coarsewaypoint);
      sensorData.relheading2home = CalcRelHeading(compassheading, sensorData.coarse2home);
      temp = TinyGPSPlus::cardinal(sensorData.coarsewaypoint); 
      temp.toCharArray(sensorData.waypointCardinal,8);
      temp = TinyGPSPlus::cardinal(compassheading); 
      temp.toCharArray(sensorData.compassCardinal, 8);
      sensorData.nrOfSatellites = gps.satellites.value();
      saveSensorDataToJSON();
  }

  if (nrsatt > 3){
        digitalWrite(led,HIGH);
  }else{
        digitalWrite(led,LOW);
  }

  if (fix.isUpdated())
    {
        GPSFix = atol(fix.value());         
    }
}

float GetCompassHeading(){
  //sensors_event_t event;
  //compass.getEvent(&event);
  float sum = 0.0;
  xyzFloat gValue = myMPU9250.getGValues();
  xyzFloat gyr = myMPU9250.getGyrValues();
  xyzFloat magValue = myMPU9250.getMagValues();
  float temp = myMPU9250.getTemperature();
  float resultantG = myMPU9250.getResultantG(gValue);
  previous_compassheading = compassheading;
  // Calculate heading
  float heading = atan2(magValue.y, magValue.x);
  //float heading = atan2(event.magnetic.y, event.magnetic.x);
  float declinationAngle = config.declAngleRad;
  heading += declinationAngle;
  
  // Correct for heading < 0deg and heading > 360deg
  if (heading < 0){
    heading += 2.0 * PI;
  }

  if (heading > 2.0 * PI){
    heading -= 2.0 * PI;
  }
  // Convert to degrees
  float headingDegrees = heading * 180.0/M_PI;
  headingraw = headingDegrees;

    if(config.compOffset >= 0){
      if(headingDegrees < config.compOffset){
        headingDegrees = headingDegrees - config.compOffset + 360.0;
      }else{
        headingDegrees = headingDegrees - config.compOffset;
      }
    }else{
        headingDegrees = headingDegrees + (-1.0 * config.compOffset);
        if(headingDegrees >= 360)
        {
            headingDegrees = headingDegrees - 360;
        }
    }
  return headingDegrees;
}

void getInitialReadings(){
  String temp;
  sensorData.gpsTime = gps.time.centisecond();
  sensorData.compassHeading = GetCompassHeading();
  temp = TinyGPSPlus::cardinal(sensorData.compassHeading);
  temp.toCharArray(sensorData.compassCardinal,8);
  previous_compassheading = sensorData.compassHeading;
  // coarsewaypoint = coarse2waypoint(config.WAYPOINT_LAT, config.WAYPOINT_LON);
  // distancewaypoint = distance2waypoint(config.WAYPOINT_LAT, config.WAYPOINT_LON);
  //relheading = CalcRelHeading(sensorData.compassHeading,coarsewaypoint);
  temp = TinyGPSPlus::cardinal(sensorData.coarsewaypoint);
  temp.toCharArray(sensorData.waypointCardinal,8);
  sensorData.coarse2home = coarse2waypoint(sensorData.homeBaseLat, sensorData.homeBaseLon);
  sensorData.distance2home = distance2waypoint(sensorData.homeBaseLat, sensorData.homeBaseLon);
  temp = TinyGPSPlus::cardinal(sensorData.coarse2home);
  temp.toCharArray(sensorData.cardinal2home,8);
  sensorData.ownLat = gps.location.lat();
  sensorData.ownLon = gps.location.lng();
  sensorData.nrOfSatellites = gps.satellites.value();
  saveSensorDataToJSON();
}

// Printline functions
static void printFloat(float val, bool valid, int len, int prec){
  if (!valid){
    while (len-- > 1)
      Serial.print('*');
    Serial.print(' ');
  }
  else{
    Serial.print(val, prec);
    int vi = abs((int)val);
    int flen = prec + (val < 0.0 ? 2 : 1); // . and -
    flen += vi >= 1000 ? 4 : vi >= 100 ? 3 : vi >= 10 ? 2 : 1;
    for (int i=flen; i<len; ++i)
      Serial.print(' ');
  }
  smartDelay(0);
}

