redd82/HaptiCap_V2_ESP32/src/main.cpp
static void printInt(unsigned long val, bool valid, int len){
  char sz[32] = "*****************";
  if (valid)
    sprintf(sz, "%ld", val);
  sz[len] = 0;
  for (int i=strlen(sz); i<len; ++i)
    sz[i] = ' ';
  if (len > 0) 
    sz[len-1] = ' ';
  Serial.print(sz);
  smartDelay(0);
}

static void printDateTime(TinyGPSDate &d, TinyGPSTime &t){
  if (!d.isValid()){
    Serial.print(F("********** "));
  }
  else{
    char sz[32];
    sprintf(sz, "%02d/%02d/%02d ", d.month(), d.day(), d.year());
    Serial.print(sz);
  }
  
  if (!t.isValid()){
    Serial.print(F("******** "));
  }
  else{
    char sz[32];
    sprintf(sz, "%02d:%02d:%02d ", t.hour(), t.minute(), t.second());
    Serial.print(sz);
  }
  printInt(d.age(), d.isValid(), 5);
  smartDelay(0);
}

static void printStr(const char *str, int len){
  int slen = strlen(str);
  for (int i=0; i<len; ++i)
    Serial.print(i<slen ? str[i] : ' ');
  smartDelay(0);
}

static void printLines(unsigned long distance2Waypoint, float course2Waypoint, float compheading,const char *cardinal2Waypoint,float relheading,float relheading2h){
  if(bPrintHeader){
  Serial.print("TinyGPS Library version: ");
  Serial.println(TinyGPSPlus::libraryVersion());
  Serial.println();
  Serial.println(F("Sats HDOP  Latitude   Longitude   Fix  Date       Time     Date Alt    Course Speed Card  Dist.   Course Card    Heading    Chars Sentences  Chksm   RelHDGWP  RelHDG2H   PWM      PWM      PWM     PWM     Touch0     Touch3  "));
  Serial.println(F("           (deg)      (deg)       Age                      Age  (m)    --- from GPS ----  --- to Waypoint ---  --Compass--  RX    RX         Fail     (deg)      (deg)    Front    Right    Rear    Left                       "));
  Serial.println(F("-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------"));
  }
  bPrintHeader = 0;
  printInt(gps.satellites.value(), gps.satellites.isValid(), 5);
  printFloat(gps.hdop.hdop(), gps.hdop.isValid(), 6, 1);
  printFloat(gps.location.lat(), gps.location.isValid(), 11, 6);
  printFloat(gps.location.lng(), gps.location.isValid(), 12, 6);
  printInt(gps.location.age(), gps.location.isValid(), 5);
  printDateTime(gps.date, gps.time);
  printFloat(gps.altitude.meters(), gps.altitude.isValid(), 7, 2);
  printFloat(gps.course.deg(), gps.course.isValid(), 7, 2);
  printFloat(gps.speed.kmph(), gps.speed.isValid(), 6, 2);
  printStr(gps.course.isValid() ? TinyGPSPlus::cardinal(gps.course.deg()) : "*** ", 7);
  printInt(distance2Waypoint, gps.location.isValid(), 9);
  printFloat(course2Waypoint, gps.location.isValid(), 7, 2);
  printStr(gps.location.isValid() ? cardinal2Waypoint : "*** ", 5);
  printFloat((compheading),true,7,2);
  printStr(true ? TinyGPSPlus::cardinal(compheading) : "*** ", 6);
  printInt(gps.charsProcessed(), true, 6);
  printInt(gps.sentencesWithFix(), true, 10);
  printInt(gps.failedChecksum(), true, 9);
  printFloat((relheading),true,11,2);
  printFloat((relheading2h),true,11,2);          
  printInt(pwm_front, true, 9);
  printInt(pwm_right, true, 9);
  printInt(pwm_rear, true, 9);
  printInt(pwm_left, true, 9);
  printInt(touchValueT0, true, 9);
  printInt(touchValueT3, true, 9);  
  Serial.println();  
}

void printConfigInMemory(){
  Serial.print("As Accesspoint: ");
  Serial.println(config.asAP);
  Serial.print("Client to SSID: ");
  Serial.println(config.clientSSID);
  Serial.print("Client Password: ");
  Serial.println(config.clientPasswd);
  Serial.print("Connection Timeout: ");
  Serial.println(config.connectionTimeOut);
  Serial.print("Devicename: ");
  Serial.println(config.deviceName);
  Serial.print("Device password: ");
  Serial.println(config.apPasswd);
  Serial.print("GPS polling(s): ");
  Serial.println(config.gpsPollSec);
  Serial.print("Target reached: ");
  Serial.println(config.targetReached);
  Serial.print("Compass polling(ms): ");
  Serial.println(config.compPollMs);
  Serial.print("Compass offset(deg): ");
  Serial.println(config.compOffset);
  Serial.print("Homebase(lat): ");
  Serial.println(config.HOME_LAT,6);
  Serial.print("Homebase(lon):" );
  Serial.println(config.HOME_LON,6);
  Serial.print("Waypoint(lat): ");
  Serial.println(config.WAYPOINT_LAT,6);
  Serial.print("Waypoint(lon):" );
  Serial.println(config.WAYPOINT_LON,6);  
  Serial.print("Declanation angle(rads): ");
  Serial.println(config.declAngleRad,12);
  Serial.print("Sleeptime(mins): ");
  Serial.println(config.sleepMins);
  Serial.print("Threshold touch: ");
  Serial.println(config.touchThreshold);
  Serial.print("Enable touch: ");
  Serial.println(config.touchEnabled);
  Serial.print("Timezone offset: ");
  Serial.println(config.timeZoneOffset);
  Serial.print("Pulsed max distance: ");
  Serial.println(config.maxDistance);
  Serial.print("Max Delay between pulses: ");
  Serial.println(config.maxDelay);

  Serial.print("FTP Enabled: ");
  Serial.println(config.ftpEnabled);  
  bDumpConfig = 0;
  Serial.println(); 
}

void printCalDataInMemory(){
  Serial.print("magBiasX: ");
  Serial.println(caldata.magBiasX,6);
  Serial.print("magBiasY: ");
  Serial.println(caldata.magBiasY,6);
  Serial.print("magBiasZ: ");
  Serial.println(caldata.magBiasZ,6);
  Serial.print("magScaleFacX: ");
  Serial.println(caldata.magScaleFacX,6);
  Serial.print("magScaleFacY: ");
  Serial.println(caldata.magScaleFacY,6);
  Serial.print("magScaleFacZ: ");
  Serial.println(caldata.magScaleFacZ,6);
  Serial.print("gyroBiasX: ");
  Serial.println(caldata.gyroBiasX,6);
  Serial.print("gyroBiasY: ");
  Serial.println(caldata.gyroBiasY,6);
  Serial.print("gyroBiasZ: ");
  Serial.println(caldata.gyroBiasZ,6);
  Serial.print("accelBiasX: ");
  Serial.println(caldata.accelBiasX,6);
  Serial.print("accelBiasY: ");
  Serial.println(caldata.accelBiasY,6);
  Serial.print("accelBiasZ:" );
  Serial.println(caldata.accelBiasZ,6);
  Serial.print("accelScaleX: ");
  Serial.println(caldata.accelScaleX,6);
  Serial.print("accelScaleY:" );
  Serial.println(caldata.accelScaleY,6);  
  Serial.print("accelScaleZ: ");
  Serial.println(caldata.accelScaleZ,6);
  bDumpConfig = 0;
  Serial.println(); 
}

void printDebugSettingsInMemory(){
  Serial.print("Debug2Serial: ");
  Serial.println(debugSettings.debug2Serial);  
  Serial.print("Debug RAW GPS to telnet: ");
  Serial.println(debugSettings.debugData2Serial);
  Serial.print("Haptic feedback Debug: ");
  Serial.println(debugSettings.debugHaptic);
}

void webServerSetup(){
// Webserver setup responses
  webServer.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, "/index.html", String(), false, processor);
      timerRestart(timer2);
      if(debugSettings.debug2Serial){
        Serial.println("index called");
      }
    }
  );

    webServer.on("/restart", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      saveConfiguration(SPIFFS, filename, config);
      esp_restart();
    }
  );

