redd82/HaptiCap_V2_ESP32/src/main.cpp
  webServer.onRequestBody(
        [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total)
        {
            if ((request->url() == "/settings/settings_form") && (request->method() == HTTP_POST))
            {
                if (DeserializationError::Ok == deserializeJson(configDoc, (const char*)data))
                {
                    JsonObject obj = configDoc.as<JsonObject>();
                    putJSONConfigDataInMemory();
                    saveConfiguration(SPIFFS, filename, config);
                    printConfigInMemory();
                    if(config.asAP){
                      delay(1000);
                      esp_restart();
                    }
                }
                request->send(200, "application/json", "{ \"status\": 0 }");
            } else if ((request->url() == "/settings/calibration_form") && (request->method() == HTTP_POST))
            {
                if (DeserializationError::Ok == deserializeJson(calDataDoc, (const char*)data))
                {
                    JsonObject obj = calDataDoc.as<JsonObject>();
                    putJSONCalibrationDataInMemory();
                    saveCalibrationData(SPIFFS, filename_cal, caldata);
                }
                request->send(200, "application/json", "{ \"status\": 0 }");
            } else if ((request->url() == "/settings/debug_form") && (request->method() == HTTP_POST))
            {
                if (DeserializationError::Ok == deserializeJson(debugSettingsDoc, (const char*)data))
                {
                    JsonObject obj = debugSettingsDoc.as<JsonObject>();
                    putJSONDebugSettingsInMemory();
                    saveDebugSettings(SPIFFS, filename_debug, debugSettings);
                }
                request->send(200, "application/json", "{ \"status\": 0 }");
            }
        }
    );

  webServer.on(fileCss.c_str(), HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, fileCss.c_str(), "text/css");
    }
  );

  webServer.on(fileCssMap.c_str(), HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, fileCssMap.c_str(), "text/css");
    }
  );

  webServer.on(fileJs.c_str(), HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, fileJs.c_str(), "application/javascript");
    }
  );

  webServer.on(fileJsMap.c_str(), HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, fileJsMap.c_str(), "application/javascript");
    }
  );

  webServer.on("/getGPSTime", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      String temp = getGPSTimeMins();
      request->send(200, "application/json", "{ \"GPSTime\" : \"" + temp + "\" }");
    }
  );

  webServer.on("/getGPSDate", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      String temp = getGPSDate();
      request->send(200, "application/json", "{ \"GPSDate\" : \"" + temp + "\" }");
    }
  );

  webServer.on("/getSensorData", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      String temp;
      serializeJson(SensorDataDoc, temp);
      request->send(200, "application/json", temp );
    }
  );

  webServer.on("/setHome", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      // request->send(200, "application/json", temp );
      SensorDataDoc["homeBaseLat"] = gps.location.lat();
      SensorDataDoc["homeBaseLon"] = gps.location.lng();
      request->send(200, "application/json", "{ \"status\": 0 }");
    }
  );


  webServer.on("/hapticap.json", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, "/hapticap.json", "application/json");
    }
  );

  webServer.on("/caldata.json", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, "/caldata.json", "application/json");
    }
  );

    webServer.on("/debug.json", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, "/debug.json", "application/json");
    }
  );

  webServer.on("/getConfigToSerial", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      printConfigInMemory();
      request->send(200, "application/json", "{ \"status\": 0 }");
    }
  );

  webServer.on("/map1.jpg", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, "/map1.jpg", "image/jpeg");
    }
  );

  webServer.on("/manifest.json", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, "/manifest.json", "application/json");  
    }
  );

    webServer.on("/favicon.ico", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, "/favicon.ico", "image/ico");  
    }
  );

    webServer.on("/logo192.png", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, "/logo192.png", "image/png");  
    }
  );

  webServer.onNotFound( []( AsyncWebServerRequest * request )
     {
      request->send(SPIFFS, "/redirect.html", String(), false, processor);
      timerRestart(timer2);
      Serial.println("redirect called");
    });
  
 
  webServer.begin();
  Serial.print("HTTP Started on port: ");
  Serial.println(config.http_port);
}

void setup(){
  // Serial port for debugging purposes
  Serial.begin(SerialUSBBaud);
  Serial2.begin(GPSBaud);
  delay(1000);

  // Initialize SPIFFS
  if(!SPIFFS.begin(true)){
      while (1)
        Serial.println("SPIFFS.begin() failed");
  } else {
     listDir(SPIFFS, "/", 0);
  }

  Serial.println();
  delay(1000);
  loadConfiguration(SPIFFS, filename, config);
  loadDebugSettings(SPIFFS, filename_debug, debugSettings);  
  
  Serial.println();
  Serial.print("HaptiCap version: ");
  Serial.println(SWVERSION);
  Serial.println("By Chrysnet.com and Triznet.com");

//Setup interrupt on Touch Pad 1 (GPIO0) and wake up
  touchAttachInterrupt(T0, callbackT0, config.touchThreshold);
  touchAttachInterrupt(T3, callbackT3, config.touchThreshold);
  esp_sleep_enable_touchpad_wakeup();
  
// Initialize outputs
  pinMode(buttonPin,INPUT);
  pinMode(led, OUTPUT);
  pinMode(dta_rdy_pin,INPUT);

// timer0 setup
  timer0 = timerBegin(0, 80, true);
  timerAttachInterrupt(timer0, &onTimer0, true);
  timerAlarmWrite(timer0, (config.gpsPollSec * 1000000), true);           // 1000 ms
// timer1 setup
  timer1 = timerBegin(1, 80, true);
  timerAttachInterrupt(timer1, &onTimer1, true);
  timerAlarmWrite(timer1, (config.compPollMs * 1000), true);            // 1 ms
// timer2 setup
  timer2 = timerBegin(2, 80, true);
  timerAttachInterrupt(timer2, &onTimer2, true);
  timerAlarmWrite(timer2, (config.sleepMins * 60000000), true);            // 1 min
  
//PWM setup
  ledcSetup(pwmhapticfront, hapticfreq, resolution);
  ledcSetup(pwmhapticright, hapticfreq, resolution);
  ledcSetup(pwmhapticrear, hapticfreq, resolution);
  ledcSetup(pwmhapticleft, hapticfreq, resolution);
  ledcAttachPin(hapticfront, pwmhapticfront);
  ledcAttachPin(hapticright, pwmhapticright);
  ledcAttachPin(hapticrear, pwmhapticrear);
  ledcAttachPin(hapticleft, pwmhapticleft);
  digitalWrite(led, 0);

